/*================================================================================================
File name:		lib/klib.c
Description:	*常规函数库(非底层函数)
Copyright:		Chauncey Zhang
Date:		 	2019-6-29
===============================================================================================*/


#include"const.h"
#include"func_proto.h"


/*======================================================================*
                               itoa
	================================================================
						将整数转化为字符串
 *======================================================================*/
/* 数字前面的 0 不被显示出来, 比如 0000B800 被显示成 B800 */
PUBLIC char * itoa(char * str, int num)
{
	char *	p = str;
	char	ch;
	int	i;
	int	flag = FALSE;

	*p++ = '0';
	*p++ = 'x';

	if(num == 0)
	{
		*p++ = '0';
	}
	else
	{	
		for(i=28;i>=0;i-=4)
		{
			ch = (num >> i) & 0xF;
			if(flag || (ch > 0))
			{
				flag = TRUE;
				ch += '0';
				if(ch > '9')
				{
					ch += 7;
				}
				*p++ = ch;
			}
		}
	}

	*p = 0;

	return str;
}

/*======================================================================*
                               disp_int
 *======================================================================*/
PUBLIC void disp_int(int input)
{
	char output[16];
	itoa(output, input);
	disp_str(output);
}

